Revit 2027 API
IFCGeometryInfo.CreateFaceGeometryInfo(ExporterIFC, Plane, XYZ, Double, Boolean) Method
 Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCGeometryInfo CreateFaceGeometryInfo(
	ExporterIFC ExporterIFC,
	Plane Plane,
	XYZ ProjDir,
	double epsilon,
	bool createRepresentations
)
Public Shared Function CreateFaceGeometryInfo (
	ExporterIFC As ExporterIFC,
	Plane As Plane,
	ProjDir As XYZ,
	epsilon As Double,
	createRepresentations As Boolean
) As IFCGeometryInfo
public:
static IFCGeometryInfo^ CreateFaceGeometryInfo(
	ExporterIFC^ ExporterIFC,
	Plane^ Plane,
	XYZ^ ProjDir,
	double epsilon,
	bool createRepresentations
)
static member CreateFaceGeometryInfo :
        ExporterIFC : ExporterIFC *
        Plane : Plane *
        ProjDir : XYZ *
        epsilon : float *
        createRepresentations : bool -> IFCGeometryInfo
Parameters
ExporterIFC ExporterIFC
 The exporter.
Plane Plane
 The plane in which the face handles must lie.
ProjDir XYZ
 The normal vector to the input plane.
epsilon Double
 The epsilon value used to process surfaces.
createRepresentations Boolean
 Indicates if this should also create geometry representation handles.
Return Value
IFCGeometryInfo
 The new geometry info container.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCGeometryInfo Class
CreateFaceGeometryInfo Overload
Autodesk.Revit.DB.IFC Namespace